Revit 2027 API
RevitLinkOptions.SetWorksetConfiguration Method
 Sets the set of worksets to open when creating the link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetWorksetConfiguration(
	WorksetConfiguration config
)
Public Sub SetWorksetConfiguration (
	config As WorksetConfiguration
)
public:
void SetWorksetConfiguration(
	WorksetConfiguration^ config
)
member SetWorksetConfiguration :
        config : WorksetConfiguration -> unit
Parameters
config WorksetConfiguration
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevitLinkOptions Class
Autodesk.Revit.DB Namespace